In [1]:
import pandas as pd
df = pd.read_csv("Dados consolidados.csv", sep=';')
df.head()

,RENATO,COSTA OESTE,CALOI ANDES PRETA,10,02/05/18 06:30,02/05/18 15:58
0,KETTY,10,MONARK 10 PRETA,11,02/05/18 06:44,02/05/18 18:49
1,MAYCON,CAFIS,CALOI EASY RIDER ROXA,12,02/05/18 06:45,02/05/18 07:50
2,ANDRIELE,CAFIS,CALOI EASY RIDER ROXA,13,02/05/18 06:45,02/05/18 07:50
3,MARCO,370452,VENZO RAPTOR PRETA,1,02/05/18 07:13,02/05/18 08:47
4,BRUNO,CAFIS,SEM MARCA PRETA,2,02/05/18 07:20,02/05/18 08:47

In [2]:
df.shape

(6993, 6)

In [3]:
#adicionando os valores que foram identicados como nomes de coluna em uma linha e renomeando as colunas
col = list(df.columns)
df.columns = ['NOME', 'RA', 'CARACTERISTICA', 'index2', 'DT_ENTRADA', 'DT_SAIDA']
col_dict = {'NOME': col[0], 'RA': col[1], 'CARACTERISTICA': col[2], 'DT_ENTRADA': col[4], 'DT_SAIDA': col[5]}
df = df.append(col_dict, ignore_index=True)
#ordenando o df pela data de entrada
df = df.sort_values(by='DT_ENTRADA')
#apagando colunas inuteis
df = df.reset_index().drop(columns=['index', 'index2'])
df.shape

(6994, 5)

In [4]:
df.head()

,NOME,RA,CARACTERISTICA,DT_ENTRADA,DT_SAIDA
0,RENATO,COSTA OESTE,CALOI PRETA,01/02/19 06:26,01/02/19 15:32
1,OSWALDO,COSTA OESTE,SEM MARCA MARROM,01/02/19 07:41,01/02/19 16:53
2,JOSE CARLOS,207772,TURIM PRETA E LARANJA,01/02/19 08:02,01/02/19 12:28
3,ALEXANDRE,1561588,GROOVE PRETA,01/02/19 08:03,01/02/19 14:50
4,ALEXANDRE,1142186,B.TWIN AZUL,01/02/19 08:13,01/02/19 16:55

In [5]:
df.describe()

         NOME           RA   CARACTERISTICA      DT_ENTRADA        DT_SAIDA
count    6994         6994             6993            6994            6873
unique    700          994             1682            6449            5941
top     LUCAS  COSTA OESTE  SEM MARCA PRETA  04/05/18 18:24  05/12/18 18:46
freq      284          176              279               3               5

In [6]:
# checando tipo de cada coluna
for col in df.columns:
    print(type(df[col].iloc[0]))

<type 'str'>
<type 'str'>
<type 'str'>
<type 'str'>
<type 'str'>

In [12]:
# datas de saida mal formatadas
df[df['DT_SAIDA'].apply(lambda x: len(str(x)) != 14)].shape

(125, 5)

In [8]:
# datas de entrada mal formatadas
df[df['DT_ENTRADA'].apply(lambda x: len(str(x)) != 14)]

Empty DataFrame
Columns: [NOME, RA, CARACTERISTICA, DT_ENTRADA, DT_SAIDA]
Index: []

In [9]:
# procurando por RA's que nao sao numericos
df_ra_false = pd.DataFrame()
for index, row in df.iterrows():
    try:
        int(row['RA'])
    except:
        df_ra_false = df_ra_false.append(row)
df_ra_false['RA'].value_counts()

COSTA OESTE             176
CAFIS                    55
R.U                      24
JURISEG                  24
CAFIS                    11
ESTAGIARIO/ DAELN        10
CAIXA ECONOMICA          10
CURSINHO SOLIDARIO        7
CONTROL                   6
ESTAGIARIO/DAELN          5
CURSINHO SOLIDARIO        3
ESTAGIARIO / DAELN        2
COSTA OESTE               2
CALOURO                   2
30511 DAELN               1
0,711805556               1
155 FUNTEF                1
ESTAGIARIO DAELN          1
CURSO SOLIDARIO           1
17:47+                    1
FUNTEF 0155               1
ASSUTEF                   1
LIBRAS                    1
ALUNA/ INTERCAMBIO        1
130572863 PÃ“S GRAD        1
8286053-3                 1
CAIXA ECONOMICA           1
ESTAGIARIO/ DAELN         1
ESTAGIARIO /DAELN         1
CX ECONOMICA FEDERAL      1
0,769444444               1
30511 DAELN               1
Name: RA, dtype: int64

In [11]:
df_ra_false.shape

(355, 5)

In [16]:
# NUMERO DE NULOS EM CADA COLUNA
len(df) - df.count()

NOME                0
RA                  0
CARACTERISTICA      1
DT_ENTRADA          0
DT_SAIDA          121
dtype: int64